app/controllers/cooties_controller.rb

  def index
    @cooties = Cootie.all
---
SELECT * FROM "cooties"

  def show
    @cootie = Cootie.find(params[:id])
---
SELECT * FROM "cooties" WHERE ("cooties"."id" = 1)

  def edit
    @cootie = Cootie.find(params[:id])
---
SELECT * FROM "cooties" WHERE ("cooties"."id" = 1)

  def create
    @cootie = Cootie.new(params[:cootie])

    respond_to do |format|
      if @cootie.save
---
INSERT INTO "cooties" ("fortune3", "fortune4", "created_at", "fortune5", "fortune6", "updated_at", "fortune7", "fortune8", "to_email", "pickedup", "from_email", "fortune1", "fortune2") VALUES('The next book you read will rock.', 'Photos don''t do you justice.', '2010-09-12 05:05:35', 'Pick up the next penny you see. ', 'The Giants will win.', '2010-09-12 05:05:35', 'You will be lucky on Thursday.', 'Neil Patrick Harris likes you.', 'anna_billstrom@yahoo.com', 'f', 'banane@gmail.com', 'You will find parking.', 'Your burrito smells like toes.')

  def update
    @cootie = Cootie.find(params[:id])
---
SELECT * FROM "cooties" WHERE ("cooties"."id" = 1)